/* -------------------------------------------- */
/*                  Legacy var                  */
/* -------------------------------------------- */

//* var로 선언한 변수의 스코프는 함수 스코프이거나 전역 스코프입니다.
//* 블록 기준으로 스코프가 생기지 않기 때문에 블록 밖에서 접근 가능합니다.

let outside = 'outer';

{
  console.log(outside);

  let inside = 'inner';
  console.log(inside);
}
let inside = 'another';
//* var는 변수의 중복 선언을 허용합니다

var a = 10;
// var a = 5;
//es에선 에러를 알려주지만 실제 브라우저 콘솔창에는 에러가 나오지않음

let b = 30;
// let b = 50;
// 실제 브라우저에서도 에러가 나옴

//* 선언하기 전 사용할 수 있는 var
